
#Область ОбработчикиСобытийЭлементовТаблицыФормыТовары

&НаКлиенте
Процедура ТоварыКоличествоПриИзменении(Элемент)

	ТекущиеДанные = Элементы.Товары.ТекущиеДанные;
	ДанныеИзДругогоМетода = ПримерСтруктуры();
	
	ПересчитатьСуммуСтроки(ТекущиеДанные, ДанныеИзДругогоМетода);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Функция ПримерСтруктуры()
	
	ОписаниеЧеловека = Новый Структура;
	ОписаниеЧеловека.Вставить("Имя", "Антон");
	//@skip-check use-non-recommended-method
	ОписаниеЧеловека.Вставить("НачалоРаботы", ТекущаяДата());																				
	ОписаниеЧеловека.Вставить("Стаж", 14);
	ОписаниеЧеловека.Вставить("ШтатныйСотрудник", Ложь);
	
	Возврат ОписаниеЧеловека;

КонецФункции

&НаКлиенте
Процедура ПересчитатьСуммуСтроки(Строка, Знач ОписаниеПользователя)
	Строка.Сумма = Строка.Количество * Строка.Цена;
	
	Сообщение = Новый СообщениеПользователю();
	Сообщение.Текст = ОписаниеПользователя.Имя;
	Сообщение.Сообщить();
	
	// Код добавленный для второго коммита в репозитории
КонецПроцедуры

#КонецОбласти
